socialNetwork/wrk2/digital-ocean1/COMMAND_12/35
Running 1m test @ http://143.110.248.178:31111/wrk2-api/home-timeline/read
  8 threads and 32 connections
  Thread calibration: mean lat.: 2506.845ms, rate sampling interval: 9699ms
  Thread calibration: mean lat.: 2519.263ms, rate sampling interval: 9748ms
  Thread calibration: mean lat.: 2455.959ms, rate sampling interval: 9592ms
  Thread calibration: mean lat.: 2544.518ms, rate sampling interval: 9863ms
  Thread calibration: mean lat.: 2532.460ms, rate sampling interval: 9797ms
  Thread calibration: mean lat.: 2514.602ms, rate sampling interval: 9666ms
  Thread calibration: mean lat.: 2527.396ms, rate sampling interval: 9863ms
  Thread calibration: mean lat.: 2533.141ms, rate sampling interval: 9666ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.22s     8.29s   34.11s    57.67%
    Req/Sec    52.40      1.46    55.00     90.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.41s 
 75.000%   27.21s 
 90.000%   31.51s 
 99.000%   34.11s 
 99.900%   34.54s 
 99.990%   34.73s 
 99.999%   34.87s 
100.000%   34.87s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5394.431     0.000000            1         1.00
    8765.439     0.100000         2112         1.11
   11591.679     0.200000         4225         1.25
   14573.567     0.300000         6336         1.43
   17563.647     0.400000         8445         1.67
   20414.463     0.500000        10557         2.00
   21839.871     0.550000        11615         2.22
   23429.119     0.600000        12679         2.50
   24936.447     0.650000        13722         2.86
   25968.639     0.700000        14790         3.33
   27213.823     0.750000        15841         4.00
   27967.487     0.775000        16366         4.44
   28737.535     0.800000        16898         5.00
   29474.815     0.825000        17422         5.71
   30113.791     0.850000        17957         6.67
   30851.071     0.875000        18485         8.00
   31195.135     0.887500        18744         8.89
   31506.431     0.900000        19000        10.00
   31801.343     0.912500        19264        11.43
   32112.639     0.925000        19528        13.33
   32473.087     0.937500        19800        16.00
   32653.311     0.943750        19928        17.78
   32849.919     0.950000        20064        20.00
   33030.143     0.956250        20187        22.86
   33259.519     0.962500        20326        26.67
   33472.511     0.968750        20455        32.00
   33587.199     0.971875        20524        35.56
   33685.503     0.975000        20605        40.00
   33751.039     0.978125        20658        45.71
   33849.343     0.981250        20731        53.33
   33914.879     0.984375        20782        64.00
   33980.415     0.985938        20828        71.11
   34045.951     0.987500        20870        80.00
   34078.719     0.989062        20893        91.43
   34111.487     0.990625        20918       106.67
   34177.023     0.992188        20956       128.00
   34209.791     0.992969        20973       142.22
   34242.559     0.993750        20993       160.00
   34275.327     0.994531        21005       182.86
   34308.095     0.995313        21021       213.33
   34340.863     0.996094        21035       256.00
   34373.631     0.996484        21046       284.44
   34373.631     0.996875        21046       320.00
   34406.399     0.997266        21063       365.71
   34406.399     0.997656        21063       426.67
   34439.167     0.998047        21071       512.00
   34471.935     0.998242        21077       568.89
   34504.703     0.998437        21087       640.00
   34504.703     0.998633        21087       731.43
   34504.703     0.998828        21087       853.33
   34537.471     0.999023        21094      1024.00
   34537.471     0.999121        21094      1137.78
   34537.471     0.999219        21094      1280.00
   34570.239     0.999316        21098      1462.86
   34570.239     0.999414        21098      1706.67
   34603.007     0.999512        21104      2048.00
   34603.007     0.999561        21104      2275.56
   34603.007     0.999609        21104      2560.00
   34603.007     0.999658        21104      2925.71
   34603.007     0.999707        21104      3413.33
   34635.775     0.999756        21105      4096.00
   34668.543     0.999780        21107      4551.11
   34668.543     0.999805        21107      5120.00
   34668.543     0.999829        21107      5851.43
   34668.543     0.999854        21107      6826.67
   34734.079     0.999878        21108      8192.00
   34734.079     0.999890        21108      9102.22
   34734.079     0.999902        21108     10240.00
   34799.615     0.999915        21109     11702.86
   34799.615     0.999927        21109     13653.33
   34799.615     0.999939        21109     16384.00
   34799.615     0.999945        21109     18204.44
   34799.615     0.999951        21109     20480.00
   34865.151     0.999957        21110     23405.71
   34865.151     1.000000        21110          inf
#[Mean    =    20222.683, StdDeviation   =     8286.738]
#[Max     =    34832.384, Total count    =        21110]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  25588 requests in 1.00m, 4.86MB read
Requests/sec:    426.42
Transfer/sec:     82.87KB